import { Link } from "react-router-dom";

function Home() {

  
const egyptNews = [
  {
    id:1,
    headline: "مصر تستعد لإطلاق مشروع جديد لتحسين البنية التحتية",
    // summary: "تعمل الحكومة المصرية على تطوير مشاريع جديدة لتحسين البنية التحتية في مختلف أنحاء البلاد. من المتوقع أن يساهم هذا المشروع في تعزيز النمو الاقتصادي وخلق فرص عمل جديدة. يشمل المشروع تطوير الطرق والجسور والمدن الجديدة، وهو جزء من خطة أكبر لتحديث البنية التحتية في البلاد. كما تهدف الحكومة إلى تحسين الوصول إلى الخدمات العامة من خلال هذه المشاريع. كتبه الصحفي أحمد المصري.",
    date: "2024-08-25",
    Journalist: "كتبه الصحفي أحمد المصري",
    imageUrl: "penya.webp",
    articleUrl: "https://www.egypttoday.com/Article/1/2024/08/25/infrastructure-project"
  },
  {
    id:2,
    headline: "مؤتمر دولي حول الطاقة المتجددة في القاهرة",
    // summary: "يستضيف مركز القاهرة الدولي للمؤتمرات مؤتمرًا دوليًا حول الطاقة المتجددة، حيث يتحدث فيه خبراء عالميون عن أحدث التقنيات والابتكارات في هذا المجال. سيشهد المؤتمر مشاركة واسعة من دول مختلفة تهدف إلى تبادل الخبرات وتعزيز التعاون الدولي. هذا المؤتمر يمثل خطوة مهمة نحو تحقيق أهداف التنمية المستدامة في مصر. من المتوقع أن يتم مناقشة الاستراتيجيات الجديدة لتعزيز استخدام الطاقة المتجددة في البلاد. كتبه الصحفي محمد علي.",
    date: "2024-08-24",
    Journalist: "كتبه الصحفي محمد علي",
    imageUrl: "taka.jpg",
    articleUrl: "https://www.almasryalyoum.com/news/2024/08/24/renewable-energy-conference"
  },
  {
    id:3,
    headline: "نجاح حملة تطعيم جديدة ضد الأمراض المعدية",
    // summary: "أعلنت وزارة الصحة عن نجاح الحملة الوطنية للتطعيم ضد الأمراض المعدية، التي شهدت مشاركة واسعة من المواطنين في جميع أنحاء البلاد. الحملة استهدفت تطعيم الملايين من الأطفال والبالغين ضد الأمراض مثل الحصبة والإنفلونزا. تمت الحملة بالتعاون مع المنظمات الدولية لضمان تحقيق أعلى معايير الأمان والفعالية. هذا النجاح يعكس التزام الحكومة بصحة المواطنين والوقاية من الأمراض. كتبه الصحفي نور الدين عبد الله.",
    date: "2024-08-23",
    Journalist: "كتبه الصحفي نور الدين عبد الله",
    imageUrl: "lekah.jpg",
    articleUrl: "https://www.youm7.com/news/2024/08/23/vaccination-campaign"
  },
  {
    id:4,
    headline: "مصر تعلن عن اكتشافات أثرية جديدة في الأقصر",
    // summary: "أعلنت وزارة السياحة والآثار المصرية عن اكتشافات جديدة في الأقصر تشمل مقابر وتوابيت تعود إلى العصر الفرعوني. من المتوقع أن يعزز هذا الاكتشاف السياحة الثقافية في المنطقة. تشمل الاكتشافات تماثيل وقطع أثرية نادرة تسلط الضوء على حياة المصريين القدماء. هذا الاكتشاف يضاف إلى سلسلة من الاكتشافات الأخيرة التي تعزز من مكانة مصر كوجهة رئيسية للسياحة الثقافية. كتبه الصحفي عمرو السعيد.",
    date: "2024-08-26",
    Journalist: "كتبه الصحفي عمرو السعيد",
    imageUrl: "tourism.jpg",
    articleUrl: "https://www.almasryalyoum.com/news/2024/08/26/archaeological-discoveries"
  },
  {
    id:5,
    headline: "افتتاح أكبر مركز طبي في القاهرة",
    // summary: "تم افتتاح أكبر مركز طبي في القاهرة، والذي يهدف إلى تقديم خدمات صحية متكاملة باستخدام أحدث التقنيات الطبية. يأتي هذا المشروع كجزء من جهود تحسين الرعاية الصحية في مصر. يتضمن المركز مرافق حديثة تشمل أقسام متخصصة لعلاج الأمراض المزمنة والجراحة. يسعى المركز إلى تقديم الرعاية الصحية على أعلى مستوى للمواطنين والمقيمين في القاهرة. من المتوقع أن يسهم المركز في تحسين جودة الحياة وزيادة الوصول إلى الخدمات الصحية. كتبه الصحفي خالد حسن.",
    date: "2024-08-27",
    Journalist: "كتبه الصحفي خالد حسن",
    imageUrl: "medical-center.jpg",
    articleUrl: "https://www.youm7.com/news/2024/08/27/medical-center"
  },
  {
    id:6,
    headline: "زيادة الاستثمار في قطاع التكنولوجيا في مصر",
    // summary: "أعلنت الحكومة المصرية عن خطة لزيادة الاستثمار في قطاع التكنولوجيا، تشمل دعم الشركات الناشئة وتطوير البنية التحتية الرقمية. الهدف هو تعزيز الابتكار وتحفيز النمو الاقتصادي. هذه الخطة تأتي في إطار رؤية مصر 2030 لتعزيز الاقتصاد الرقمي. تشمل الاستثمارات تطوير البنية التحتية اللازمة لدعم التحول الرقمي في القطاعات المختلفة. من المتوقع أن تسهم هذه الاستثمارات في خلق فرص عمل جديدة وزيادة تنافسية الاقتصاد المصري. كتبه الصحفي مصطفى شعبان.",
    date: "2024-08-28",
    Journalist: "كتبه الصحفي مصطفى شعبان",
    imageUrl: "tecno.jpg",
    articleUrl: "https://www.almasryalyoum.com/news/2024/08/28/tech-investment"
  },
  {
    id:7,
    headline: "تحسن في العلاقات الاقتصادية بين مصر والاتحاد الأوروبي",
    // summary: "شهدت العلاقات الاقتصادية بين مصر والاتحاد الأوروبي تحسنًا ملحوظًا، حيث تم توقيع عدة اتفاقيات تعاون تهدف إلى تعزيز التجارة والاستثمار بين الجانبين. هذه الاتفاقيات تهدف إلى تقوية العلاقات الاقتصادية وتعزيز الاستثمارات المشتركة. تشمل الاتفاقيات قطاعات مختلفة مثل الطاقة والتكنولوجيا والنقل. من المتوقع أن تسهم هذه الخطوات في تعزيز النمو الاقتصادي وتحسين التبادل التجاري بين مصر ودول الاتحاد الأوروبي. كتبه الصحفي يوسف سلامة.",
    date: "2024-08-29",
    Journalist: "كتبه الصحفي يوسف سلامة",
    imageUrl: "19.jpg",
    articleUrl: "https://www.egypttoday.com/Article/1/2024/08/29/eu-relations"
  },
  {
    id:8,
    headline: "زيادة في عدد السياح القادمين إلى مصر هذا الصيف",
    // summary: "شهدت مصر زيادة كبيرة في عدد السياح خلال الصيف الحالي، حيث أظهرت التقارير ارتفاعًا في الحجوزات وزيارة الأماكن السياحية الرئيسية، مما يساهم في انتعاش قطاع السياحة. هذه الزيادة تعكس تحسن الوضع الأمني وجاذبية مصر كوجهة سياحية. تسعى الحكومة إلى الاستفادة من هذه الطفرة السياحية من خلال تطوير المزيد من الخدمات السياحية. من المتوقع أن يستمر هذا النمو في عدد السياح خلال السنوات القادمة، مما يعزز من مكانة مصر على خريطة السياحة العالمية. كتبه الصحفي عبدالرحمن حسين.",
    date: "2024-08-30",
    Journalist: "كتبه الصحفي عبدالرحمن حسين",
    imageUrl: "egyptian-temple.jpg",
    articleUrl: "https://www.youm7.com/news/2024/08/30/tourism-increase"
  },
  
    ]

  return (
    <div className="container mx-auto p-4">
      <div className=" text-center content" dir="rtl">
          <p className="text-[25px] mb-5">   مرحبا بك في  "AS-News"   </p>
          <p >مصدرك الموثوق لأحدث الأخبار والمستجدات من جميع أنحاء العالم! نقدم لك تغطية شاملة لأهم الأحداث السياسية، الاقتصادية، الاجتماعية، والثقافية. في موقعنا، ستجد مقالات وتحليلات عميقة، بالإضافة إلى تحديثات فورية لكل ما يجري من حولك. سواء كنت تبحث عن الأخبار المحلية أو العالمية، فإننا هنا لتزويدك بكل ما تحتاجه لتبقى على اطلاع. انضم إلينا وكن دائمًا في قلب الأحداث!</p>
       <p className="text-[20px] mt-5 text-red-500">إليك اهم العناوين </p>
        </div>
      <div className="content grid grid-cols-1 md:grid-cols-2 gap-4" dir="rtl">
       
        {egyptNews.map((item) => (
          
          <div key={item.headline} className="p-8 rounded-lg shadow-2xl m-3">
            <h2 className="text-xl font-semibold mb-2">{item.headline}</h2>
            <img
              src={item.imageUrl.startsWith("http") ? item.imageUrl : `/src/assets/images/${item.imageUrl}`}
              alt={item.headline}
              className="w-full h-[15rem] mb-2"
            />
            <p className="mb-2">{item.summary}</p>
            <p className="text-lg text-green-800 mb-2">{item.date}</p>
            <p className="text-sm text-gray-500">{item.Journalist}</p>
            <Link to={'news/'+item.id}  className="text-blue-500 hover:underline">اقرأ المزيد</Link>
          </div>
          
        ))}
      </div>
    </div>
  );
}

export default Home;
